{
  "data": [
    [
      "AAPL",
      "AAPL",
      "APPLE INC",
      "Apple Inc.",
      "NSDQ",
      "USD",
      "Apple Inc. is engaged in designing, manufacturing and marketing mobile communication and media devices, personal computers, and portable digital music players. The Company's products and services include iPhone, iPad, Mac, iPod, Apple TV, a portfolio of consumer and professional software applications, the iOS and Mac OS X operating systems, iCloud, and a range of accessory, service and support offerings. It sells its products worldwide through its online stores, its retail stores, its direct sales force, third-party wholesalers, and resellers. Apple Inc. is headquartered in Cupertino, California.",
      "ONE APPLE PARK WAY",
      null,
      "CUPERTINO",
      "CA",
      "US",
      "95014",
      "408-996-1010",
      "408-974-2483",
      "tgala@apple.com",
      "http://www.apple.com",
      1.22,
      9,
      3571,
      "Electronic computers",
      199,
      "COMP-MINI",
      10,
      "Computer and Technology",
      31,
      "COMPUTER/OFFICE EQUIP",
      147000,
      2256152.25,
      274515,
      57411,
      29.76,
      36.4,
      2.38,
      7.67,
      34.07,
      33.37,
      90.59,
      19.44,
      25.41,
      21.74,
      21.74,
      44.06,
      1.16,
      1.13,
      1.5,
      0.82,
      0.61,
      16788.1,
      81979000,
      3.84,
      3.69249,
      "2021-03-31",
      1,
      1.4,
      0.4,
      40,
      "2021-09-30",
      4.52,
      "2022-09-30",
      4.75,
      3.28,
      20,
      3,
      3,
      0,
      0,
      1.35,
      1.35,
      0.06,
      58.3,
      16778.023
    ],
    [
      "AXP",
      "AXP",
      "AMER EXPRESS CO",
      "American Express Company",
      "NYSE",
      "USD",
      "American Express is a global services company, providing customers with access to products, insights and experiences that enrich lives and build business success. American Express is the only company with a strong, global presence across the entire payments chain. They are the world's largest card issuer, the premium network for high-spending card members, a processor of millions of transactions daily, and a partner that provides business-building services to a worldwide merchant base.",
      "200 VESEY STREET",
      null,
      "NEW YORK",
      "NY",
      "US",
      "10285",
      "212-640-2000",
      "212-640-0404",
      "ir@aexp.com",
      "http://www.americanexpress.com",
      1.29,
      12,
      6199,
      "Nondepository credit institutions",
      69,
      "FIN-MISC SVCS",
      13,
      "Finance",
      48,
      "FINANCE",
      64000,
      120784.62,
      36087,
      3135,
      21,
      29.54,
      1.56,
      3.47,
      4.94,
      20.36,
      18.49,
      2.2,
      19.62,
      14.29,
      11.99,
      null,
      1.51,
      1.5,
      1.72,
      1.72,
      1.14,
      803.3,
      2725488,
      30.44,
      6.09,
      "2021-03-31",
      1.68,
      1.74,
      0.06,
      3.57,
      "2021-12-31",
      7.26,
      "2022-12-31",
      9.14,
      5.34,
      8,
      0,
      10,
      1,
      1,
      2.35,
      2.32,
      0.2,
      84.67,
      801.696
    ],
    [
      "BA",
      "BA",
      "BOEING CO",
      "The Boeing Company",
      "NYSE",
      "USD",
      "The Boeing Company is the world's largest aerospace company and leading manufacturer of commercial jetliners and defense, space and security systems. A top U.S. exporter, the company supports airlines and U.S. and allied government customers. Boeing products and tailored services include commercial and military aircraft, satellites, weapons, electronic and defense systems, launch systems, advanced information and communication systems, and performance-based logistics and training. Boeing has a long tradition of aerospace leadership and innovation. The company continues to expand its product line and services to meet emerging customer needs. Its broad range of capabilities includes creating new, more efficient members of its commercial airplane family; designing, building and integrating military platforms and defense systems; creating advanced technology solutions; and arranging innovative financing and service options for customers.",
      "100 NORTH RIVERSIDE PLAZA",
      null,
      "CHICAGO",
      "IL",
      "US",
      "60606",
      "312-544-2000",
      "312-544-2082",
      null,
      "http://www.boeing.com",
      1.68,
      12,
      3721,
      "Aircraft",
      2,
      "AEROSP/DEFENSE",
      11,
      "Aerospace",
      38,
      "AEROSPACE/DEFENSE",
      141000,
      141359.25,
      58158,
      -11873,
      5852.71,
      null,
      1463.18,
      2.43,
      null,
      null,
      null,
      -8.54,
      -24.89,
      -20.42,
      -22.74,
      0.77,
      1.39,
      0.46,
      null,
      0,
      0,
      583,
      11664374,
      -31,
      -20.75,
      "2021-03-31",
      -1.17,
      -1.53,
      -0.36,
      -30.77,
      "2021-12-31",
      0.04,
      "2022-12-31",
      4.64,
      -23.25,
      9,
      1,
      4,
      0,
      1,
      1.87,
      1.94,
      0.16,
      53.57,
      582.064
    ],
    [
      "CTR",
      "CAT",
      "CATERPILLAR INC",
      "Caterpillar Inc.",
      "NYSE",
      "USD",
      "Caterpillar Inc. is a manufacturer of construction and mining equipment, diesel and natural gas engines, industrial gas turbines and diesel-electric locomotives. Caterpillar provides the solutions you need to build a successful construction contracting business. Cat Connect makes smart use of technology and services to improve your operational efficiency. Working with your Cat dealer, you can find the right combination of Cat Connect technologies and services for your sites. Cat Financial provides retail and wholesale financing solutions to Cat customers and dealers for the complete line of Cat machinery and engines, Solar gas turbines, other related equipment and marine vessels. As a captive finance company, no other financial institution knows Cat customers and dealers better than Cat Financial. They offer quality service throughout the life cycle of equipment including purchase, protect, manage and resell.",
      "510 Lake Cook Road Suite 100",
      null,
      "Deerfield",
      "IL",
      "US",
      "60015",
      "224-551-4000",
      "309-675-6620",
      "catir@cat.com",
      "http://www.caterpillar.com",
      0.96,
      12,
      3531,
      "Construction machinery",
      95,
      "MACH-CONST/MNG",
      7,
      "Industrial Products",
      26,
      "MACHINERY",
      97300,
      125605.3,
      41748,
      2998,
      27.93,
      37.82,
      2.33,
      3.01,
      8.17,
      20.82,
      22.91,
      4.35,
      9.57,
      7.18,
      8.01,
      2.53,
      1.53,
      1.09,
      1.69,
      4.12,
      1.79,
      545.3,
      2349252.5,
      28.2,
      5.46,
      "2020-12-31",
      1.46,
      2.12,
      0.66,
      45.21,
      "2021-12-31",
      8.25,
      "2022-12-31",
      10.73,
      6.56,
      6,
      0,
      8,
      0,
      1,
      2.29,
      2.29,
      0.31,
      68.82,
      543.614
    ],
    [
      "CSCO",
      "CSCO",
      "CISCO SYSTEMS",
      "Cisco Systems, Inc.",
      "NSDQ",
      "USD",
      "Cisco Systems, Inc. is the worldwide leader in IT that helps companies seize the opportunities of tomorrow by proving that amazing things can happen when you connect the previously unconnected. At Cisco customers come first and an integral part of their DNA is creating long-lasting customer partnerships and working with them to identify their needs and provide solutions that support their success. The concept of solutions being driven to address specific customer challenges has been with Cisco since its inception. Husband and wife Len Bosack and Sandy Lerner, both working for Stanford University, wanted to email each other from their respective offices located in different buildings but were unable to due to technological shortcomings. A technology had to be invented to deal with disparate local area protocols; and as a result of solving their challenge - the multi-protocol router was born.",
      "170 WEST TASMAN DRIVE",
      null,
      "SAN JOSE",
      "CA",
      "US",
      "95134",
      "408-526-4000",
      "408-853-3683",
      "marilmor@cisco.com",
      "http://www.cisco.com",
      0.94,
      7,
      3576,
      "Computer & office equipment",
      198,
      "COMP-NETWORKS",
      10,
      "Computer and Technology",
      31,
      "COMPUTER/OFFICE EQUIP",
      77500,
      216873.13,
      49301,
      11214,
      17.76,
      18.15,
      2.84,
      4.52,
      5.54,
      15.3,
      31.86,
      12.76,
      26.42,
      21.09,
      25.03,
      13.15,
      1.61,
      1.56,
      0.24,
      1.48,
      2.88,
      4221.79,
      16148787,
      8.96,
      2.38,
      "2021-01-31",
      0.68,
      0.71,
      0.03,
      4.41,
      "2021-07-31",
      2.89,
      "2022-07-31",
      3.08,
      2.92,
      7,
      2,
      7,
      0,
      0,
      1.97,
      1.9,
      0.02,
      71.73,
      4220.942
    ],
    [
      "SD",
      "CVX",
      "CHEVRON CORP",
      "Chevron Corporation",
      "NYSE",
      "USD",
      "Chevron Corporation is one of the world's leading integrated energy companies. Through its subsidiaries that conduct business worldwide, the company is involved in virtually every facet of the energy industry. Chevron explores for, produces and transports crude oil and natural gas; refines, markets and distributes transportation fuels and lubricants; manufactures and sells petrochemicals and additives; generates power; and develops and deploys technologies that enhance business value in every aspect of the company's operations.",
      "6001 BOLLINGER CANYON ROAD",
      null,
      "SAN RAMON",
      "CA",
      "US",
      "94583",
      "925-842-1000",
      "415-894-6817",
      "invest@chevron.com",
      "http://www.chevron.com",
      1.34,
      12,
      2911,
      "Petroleum refining",
      132,
      "OIL-INTL INTGD",
      12,
      "Oils/Energy",
      44,
      "OIL-INTEGRATED",
      47736,
      198011.66,
      94692,
      -5543,
      19.74,
      null,
      3.95,
      2.09,
      1.44,
      10.02,
      -0.3,
      -0.18,
      -7.87,
      -5.85,
      -0.43,
      9.38,
      1.18,
      0.92,
      0.32,
      5.16,
      5.02,
      1928.06,
      7597137,
      71.08,
      -2.96001,
      "2020-12-31",
      0.08,
      -0.01,
      -0.09,
      -112.5,
      "2021-12-31",
      5.2,
      "2022-12-31",
      5.95,
      -0.2,
      9,
      1,
      6,
      0,
      0,
      1.81,
      1.81,
      0.28,
      66.21,
      1922.66
    ],
    [
      "DOW",
      "DD",
      "DUPONT DE NEMRS",
      "DuPont de Nemours, Inc.",
      "NYSE",
      "USD",
      "DuPont de Nemours Inc. provides technology-based materials, ingredients and solutions. It serves electronic, transportation, building and construction, health and wellness, food and worker safety markets. DuPont de Nemours Inc., formerly known as DowDuPont Inc., is based in Wilmington, United States.",
      "974 CENTRE ROAD BUILDING 730",
      null,
      "WILMINGTON",
      "DE",
      "US",
      "19805",
      "302-774-1000",
      "989-832-1556",
      "investor.relations@dominion",
      "http://www.dupont.com",
      1.56,
      12,
      2821,
      "Plastics materials & resins",
      34,
      "CHEM-DIVERSIFD",
      6,
      "Basic Materials",
      19,
      "CHEMICALS",
      34000,
      41201.21,
      20397,
      -2951,
      22.34,
      22.87,
      3.2,
      2.02,
      1.45,
      10.16,
      6.39,
      3.56,
      -14.2,
      -14.47,
      12.13,
      3.31,
      2.31,
      1.52,
      0.56,
      1.2,
      1.56,
      534.53,
      2178869.75,
      53.24,
      -4.01,
      "2020-12-31",
      0.92,
      0.95,
      0.03,
      3.26,
      "2021-12-31",
      3.45,
      "2022-12-31",
      4.11,
      3.36,
      6,
      1,
      7,
      0,
      0,
      2.07,
      2.07,
      0.24,
      null,
      533.242
    ],
    [
      "DIS",
      "DIS",
      "DISNEY WALT",
      "The Walt Disney Company",
      "NYSE",
      "USD",
      "The Walt Disney Company, together with its subsidiaries and affiliates, is a leading diversified international family entertainment and media enterprise with five business segments: media networks, parks and resorts, studio entertainment, consumer products and interactive media.",
      "500 SOUTH BUENA VISTA ST",
      null,
      "BURBANK",
      "CA",
      "US",
      "91521",
      "818-560-1000",
      "818-560-1930",
      null,
      "http://www.thewaltdisneycompany.com",
      1.2,
      9,
      7990,
      "Miscellaneous amusement & recreation services",
      208,
      "MEDIA CONGLOM",
      2,
      "Consumer Discretionary",
      10,
      "MEDIA",
      203000,
      335170.34,
      65388,
      -2864,
      90.14,
      230.8,
      4.42,
      5.52,
      3.78,
      23.8,
      1.69,
      0.75,
      -7.12,
      -8.16,
      2.53,
      27.71,
      1.31,
      1.26,
      0.6,
      0,
      0,
      1815.26,
      7112109,
      48.84,
      -2.74,
      "2020-12-31",
      -0.45,
      0.32,
      0.77,
      171.11,
      "2021-09-30",
      2.05,
      "2022-09-30",
      4.98,
      2.02,
      13,
      1,
      3,
      0,
      1,
      1.61,
      1.61,
      0.25,
      65.41,
      1810.726
    ],
    [
      "GE",
      "GE",
      "GENL ELECTRIC",
      "General Electric Company",
      "NYSE",
      "USD",
      "General Electric is a high-tech industrial company that operates worldwide through its four industrial segments, Power, Renewable Energy, Aviation and Healthcare, and its financial services segment, Capital. The Power segment offers services energy production services. The Renewable Energy segment provides wind turbine platforms, hardware and software, offshore wind turbines, products and services to hydropower industry, blades for wind turbines, and high voltage equipment. The Aviation segment provides jet engines and turboprops for commercial airframes, maintenance, component repair, and overhaul services. The Healthcare segment provides healthcare technologies in medical imaging, digital solutions, drug discovery, biopharmaceutical manufacturing technologies and performance enhancement solutions. The Capital segment leases and finances aircraft, aircraft engines and helicopters, and provides financial solutions. GE is headquartered in Boston, MA.",
      "5 Necco Street",
      null,
      "BOSTON",
      "MA",
      "US",
      "02210",
      "617-443-3000",
      "203-373-3131",
      "investor@ge.com",
      "http://www.ge.com",
      1.08,
      12,
      3600,
      "Electronic, electrical equipment & components, except computer equipment",
      48,
      "DIVERSIFIED OPS",
      9,
      "Multi-Sector Conglomerates",
      30,
      "CONGLOMERATES",
      174000,
      118504.95,
      79619,
      5704,
      59.08,
      674.5,
      13.9,
      1.55,
      3.37,
      19.31,
      1.53,
      0.22,
      -1.36,
      -4.33,
      0.71,
      3.66,
      1.96,
      1.29,
      1.9,
      0.04,
      0.3,
      8784.65,
      56530284,
      4,
      -0.46,
      "2021-03-31",
      0.02,
      0.03,
      0.01,
      50,
      "2021-12-31",
      0.24,
      "2022-12-31",
      0.53,
      0.01,
      5,
      0,
      5,
      0,
      0,
      2,
      2,
      0.71,
      62.43,
      8722.28
    ],
    [
      "GS&",
      "GS",
      "GOLDMAN SACHS",
      "The Goldman Sachs Group, Inc.",
      "NYSE",
      "USD",
      "Goldman Sachs BDC, Inc. is a specialty finance company that has elected to be regulated as a business development company. GS BDC was formed by The Goldman Sachs Group, Inc. (`Goldman Sachs`) to invest primarily in middle-market companies in the United States, and is externally managed by Goldman Sachs Asset Management, L.P., an SEC-registered investment adviser and a wholly-owned subsidiary of Goldman Sachs. GS BDC seeks to generate current income and, to a lesser extent, capital appreciation primarily through direct originations of secured debt, including first lien, first lien/last-out unitranche and second lien debt, and unsecured debt, including mezzanine debt, as well as through select equity investments.",
      "200 WEST STREET",
      null,
      "NEW YORK",
      "NY",
      "US",
      "10282",
      "212-902-1000",
      "212-902-3000",
      "gs-investor-relations@gs.com",
      "http://www.goldmansachs.com",
      1.5,
      12,
      6211,
      "Security brokers & dealers",
      62,
      "FIN-INVEST BKRS",
      13,
      "Finance",
      50,
      "INVEST BKRS/MGMT",
      40500,
      119862.7,
      53498,
      9459,
      7.72,
      7.44,
      0.3,
      1.98,
      1.22,
      8.07,
      20.07,
      1.45,
      32.13,
      28.4,
      28.4,
      null,
      1.19,
      0.75,
      2.23,
      5,
      1.44,
      345.79,
      2990005,
      283.4,
      46.62,
      "2021-03-31",
      9.79,
      18.6,
      8.81,
      89.99,
      "2021-12-31",
      44.9,
      "2022-12-31",
      35.39,
      34.25,
      9,
      0,
      3,
      1,
      0,
      1.67,
      1.67,
      0.57,
      70.17,
      343.823
    ],
    [
      "HOMD",
      "HD",
      "HOME DEPOT",
      "The Home Depot, Inc.",
      "NYSE",
      "USD",
      "The Home Depot is the world's largest home improvement retailer. The Home Depot sells a wide assortment of building materials, home improvement products and lawn and garden products and provides a number of services.",
      "2455 PACES FERRY ROAD",
      null,
      "ATLANTA",
      "GA",
      "US",
      "30339",
      "770-433-8211",
      "770-431-2707",
      "investor_relations@homedepot.com",
      "http://www.homedepot.com",
      1.04,
      1,
      5211,
      "Lumber & other building materials",
      25,
      "BLDG PRD-RT/WHL",
      3,
      "Retail/Wholesale",
      14,
      "NONFOOD RETAIL/WH",
      504800,
      344705.91,
      132110,
      12866,
      25.3,
      26.67,
      2.35,
      2.61,
      104.62,
      22.29,
      5575.49,
      19.98,
      12.85,
      9.74,
      9.81,
      5.7,
      1.23,
      0.51,
      10.86,
      6.6,
      2.06,
      1075.22,
      3865719.5,
      3.06,
      11.93,
      "2021-01-31",
      2.63,
      2.74,
      0.11,
      4.18,
      "2022-01-31",
      12.67,
      "2023-01-31",
      13.83,
      12.03,
      13,
      2,
      7,
      0,
      0,
      1.7,
      1.7,
      0.18,
      69.98,
      1073.289
    ],
    [
      "IBM",
      "IBM",
      "INTL BUS MACH",
      "International Business Machines Corporation",
      "NYSE",
      "USD",
      "IBM is an information technology (IT) company. The company operates in five segments: Global Technology Services, Global Business Services, Software, Systems and Technology, and Global Financing. The Global Technology Services segment provides IT infrastructure services and business process services. The Global Business Services segment offers professional services and application management services. The Software segment consists primarily of middleware and operating systems software. The Systems and Technology segment provides computing power and storage solutions; and semiconductor technology products and packaging solutions. The Global Financing segment invests in financing assets, leverages with debt and manages the associated risks. IBM is headquartered in Armonk, New York.",
      "1 NEW ORCHARD ROAD",
      null,
      "ARMONK",
      "NY",
      "US",
      "10504",
      "914-499-1900",
      "914-765-6021",
      "ibm@computershare.com",
      "http://www.ibm.com",
      1.24,
      12,
      3570,
      "Computer & office equipment",
      203,
      "COMP-INTEGT SYS",
      10,
      "Computer and Technology",
      31,
      "COMPUTER/OFFICE EQUIP",
      30000,
      126899.3,
      73620,
      5590,
      13.07,
      16.51,
      1.77,
      1.72,
      5.9,
      8.75,
      36.67,
      5.04,
      7.58,
      7.28,
      10.47,
      20.27,
      0.93,
      0.88,
      2.38,
      6.52,
      4.59,
      893.59,
      5543581.5,
      24.08,
      5.98,
      "2021-03-31",
      1.67,
      1.77,
      0.1,
      5.99,
      "2021-12-31",
      10.86,
      "2022-12-31",
      11.88,
      8.67,
      4,
      0,
      4,
      0,
      0,
      2,
      2.11,
      0.19,
      56.41,
      891.896
    ],
    [
      "ITL",
      "INTC",
      "INTEL CORP",
      "Intel Corporation",
      "NSDQ",
      "USD",
      "Intel Corporation is one of the world's largest semiconductor chip maker. The Company develops advanced integrated digital technology products, primarily integrated circuits, for industries such as computing and communications. It also develops platforms, which it defines as integrated suites of digital computing technologies that are designed and configured to work together to provide an optimized user computing solution compared to components that are used separately. Intel designs and manufactures computing and communications components, such as microprocessors, chipsets, motherboards, and wireless and wired connectivity products, as well as platforms that incorporate these components. The Company sells its products primarily to original equipment manufacturers, original design manufacturers, PC and network communications products users, and other manufacturers of industrial and communications equipment. Intel Corporation is based in Santa Clara, California.",
      "2200 MISSION COLLEGE BLVD",
      null,
      "SANTA CLARA",
      "CA",
      "US",
      "95054",
      "408-765-8080",
      "408-765-9904",
      "investor.relations@intel.com",
      "http://www.intel.com",
      0.67,
      12,
      3674,
      "Semiconductors & related devices",
      241,
      "SEMI-GENERAL",
      10,
      "Computer and Technology",
      33,
      "ELECTRON-SEMI",
      110600,
      234082.86,
      77867,
      20899,
      12.56,
      11.04,
      1.67,
      3.01,
      2.93,
      6.79,
      27.59,
      14.56,
      28.79,
      23.93,
      28.17,
      4.01,
      1.9,
      1.54,
      0.42,
      1.39,
      2.4,
      4038,
      30178924,
      19.76,
      4.44999,
      "2021-03-31",
      1.15,
      1.39,
      0.24,
      20.87,
      "2021-12-31",
      4.62,
      "2022-12-31",
      4.66,
      5.3,
      6,
      2,
      10,
      1,
      7,
      3.02,
      3.09,
      0.02,
      63.71,
      4037.192
    ],
    [
      "JNJ",
      "JNJ",
      "JOHNSON & JOHNS",
      "Johnson & Johnson",
      "NYSE",
      "USD",
      "Johnson & Johnson is engaged in the research and development, manufacture and sale of a range of products in the healthcare field. The Company operates in three segments: Consumer, Pharmaceutical, and Medical Devices and Diagnostics. Its Consumer segment offers products for use in the baby care, skin care, oral care, wound care, and women's health fields, nutritional and over-the-counter pharmaceutical products. The company's Pharmaceutical segment provides various products in the areas of anti-infective, antipsychotic, contraceptive, dermatology, gastrointestinal, hematology, immunology, neurology, oncology, pain management, thrombosis, vaccines, and infectious diseases. Its Medical Devices and Diagnostics segment offers electrophysiology and circulatory disease management products; orthopaedic joint reconstruction, spinal care, neurological, and sports medicine products; surgical care, aesthetics, and women's health products. Johnson & Johnson is based in New Brunswick, New Jersey.",
      "ONE JOHNSON & JOHNSON PLZ",
      null,
      "NEW BRUNSWICK",
      "NJ",
      "US",
      "08933",
      "732-524-0400",
      "732-214-0332",
      null,
      "http://www.jnj.com",
      0.73,
      12,
      2834,
      "Pharmaceutical preparations",
      225,
      "Large Cap Pharma",
      4,
      "Medical",
      15,
      "DRUGS",
      134500,
      429605.03,
      82584,
      14714,
      17.15,
      19.61,
      2.62,
      5.1,
      6.79,
      14.99,
      34.92,
      13.22,
      20.68,
      17.95,
      26.36,
      3.01,
      1.21,
      0.99,
      0.52,
      4.04,
      2.48,
      2632.71,
      7401342.5,
      24.04,
      5.65999,
      "2021-03-31",
      2.31,
      2.59,
      0.28,
      12.12,
      "2021-12-31",
      9.52,
      "2022-12-31",
      10.26,
      8.03,
      7,
      1,
      3,
      0,
      0,
      1.64,
      1.64,
      0.3,
      68.3,
      2624.809
    ],
    [
      "CHL",
      "JPM",
      "JPMORGAN CHASE",
      "JPMorgan Chase & Co.",
      "NYSE",
      "USD",
      "JPMorgan Chase & Co. is a financial services firm. The Company is engaged in investment banking, financial services for consumers and small businesses, commercial banking, financial transaction processing, asset management and private equity.  It offers various investment banking products and services, including advising on corporate strategy and structure, capital-raising in equity and debt markets, risk management, market-making in cash securities and derivative instruments, prime brokerage. It also offers consumer and business, and mortgage banking products and services that include checking and savings accounts, mortgages, home equity and business loans, and investments. JPMorgan Chase & Co. is headquartered in New York.",
      "383 MADISON AVENUE",
      null,
      "NEW YORK",
      "NY",
      "US",
      "10179",
      "212-270-6000",
      "302-655-5049",
      "jpmcinvestorrelations@jpmchase.com",
      "http://www.jpmorganchase.com",
      1.22,
      12,
      6021,
      "National commercial banks",
      204,
      "BANKS-MJR REGNL",
      13,
      "Finance",
      46,
      "BANKS-MAJOR",
      255351,
      458606.41,
      129503,
      29131,
      11.52,
      12.01,
      2.3,
      3.52,
      1.84,
      12.22,
      16.66,
      1.2,
      38.38,
      31.15,
      31.15,
      null,
      0.84,
      0.86,
      1.12,
      3.6,
      2.38,
      3032.11,
      13590312,
      82.17,
      12.59,
      "2021-03-31",
      3.05,
      4.5,
      1.45,
      47.54,
      "2021-12-31",
      13.13,
      "2022-12-31",
      11.9,
      8.88,
      8,
      1,
      4,
      1,
      0,
      1.84,
      1.69,
      0.79,
      71.15,
      3008.154
    ],
    [
      "KO",
      "KO",
      "COCA COLA CO",
      "CocaCola Company (The)",
      "NYSE",
      "USD",
      "The Coca-Cola Company is the world's largest total beverage company. In addition to their namesake Coca-Cola drinks, some of their household names around the world include: AdeS soy-based beverages, Ayataka green tea, Dasani waters, Del Valle juices and nectars, Fanta, Georgia coffee, Gold Peak teas and coffees, Honest Tea, Minute Maid juices, Powerade sports drinks, Simply juices, smartwater, Sprite, vitaminwater, and Zico coconut water. At Coca-Cola, they are serious about making positive contributions to world. That starts with reducing sugar in drinks and bringing new and different drinks to people everywhere. It also means continuously working to reduce environmental impact, creating rewarding careers for associates, and bringing economic opportunity wherever they operate.",
      "ONE COCA COLA PLAZA",
      null,
      "ATLANTA",
      "GA",
      "US",
      "30313",
      "404-676-2121",
      "404-676-6792",
      "koinvestorrelations@coca-cola.com",
      "http://www.coca-colacompany.com",
      0.62,
      12,
      2080,
      "Beverages",
      20,
      "BEVERAGES-SOFT",
      1,
      "Consumer Staples",
      2,
      "BEVERAGES",
      80300,
      230892.92,
      33014,
      7747,
      24.59,
      26.92,
      3.24,
      6.91,
      10.34,
      23.09,
      41.48,
      9.34,
      28.42,
      21.59,
      25.78,
      4.05,
      1.33,
      1.13,
      1.8,
      1.68,
      3.14,
      4309.31,
      12273276,
      5.18,
      1.66999,
      "2021-03-31",
      0.5,
      0.55,
      0.05,
      10,
      "2021-12-31",
      2.18,
      "2022-12-31",
      2.32,
      1.95,
      7,
      1,
      6,
      0,
      0,
      1.93,
      1.93,
      1.01,
      67.28,
      4265.788
    ],
    [
      "MCD",
      "MCD",
      "MCDONALDS CORP",
      "McDonald's Corporation",
      "NYSE",
      "USD",
      "McDonald's Corporation is the world's leading global food service retailer. The Company operates and franchises McDonald's restaurants, which serve a locally-relevant menu of quality food and beverages sold at various price. McDonald's global system is comprised of both Company-owned and franchised restaurants. McDonald's franchised restaurants are owned and operated under one of the following structures -conventional franchise, developmental license or affiliate. The optimal ownership structure for an individual restaurant, trading area or market (country) is based on a variety of factors, including the availability of individuals with the entrepreneurial experience and financial resources, as well as the local legal and regulatory environment in critical areas such as property ownership and franchising. The business relationship between McDonald's and its independent franchisees is of fundamental importance to overall performance and to the McDonald's brand.",
      "110 NORTH CARPENTER STREET",
      null,
      "CHICAGO",
      "IL",
      "US",
      "60607",
      "630-623-3000",
      "630-623-5004",
      null,
      "corporate.mcdonalds.com",
      0.62,
      12,
      5812,
      "Eating places",
      160,
      "RETAIL-RESTRNTS",
      3,
      "Retail/Wholesale",
      13,
      "FOOD/DRUG-RTL/WHL",
      200000,
      175317.97,
      19207.8,
      4730.5,
      27.9,
      38.84,
      3.22,
      9.13,
      null,
      27.85,
      -51.75,
      8.9,
      31.97,
      24.63,
      23.61,
      213.69,
      1.01,
      1,
      null,
      5.16,
      2.2,
      746.1,
      2360188.25,
      -10.5,
      6.31,
      "2020-12-31",
      1.75,
      1.7,
      -0.05,
      -2.86,
      "2021-12-31",
      8.42,
      "2022-12-31",
      9.22,
      6.05,
      14,
      1,
      6,
      0,
      0,
      1.6,
      1.57,
      0.25,
      66.86,
      744.232
    ],
    [
      "MMM",
      "MMM",
      "3M CO",
      "3M Company",
      "NYSE",
      "USD",
      "3M is a diversified technology company which applies science in collaborative ways to improve lives daily. The company's innovation aims to tackle some of the world's most pressing areas of concern: Raw Materials, Water, Energy & Climate, Health & Safety, Education & Development. 3M company conducts operations in Automotive, Commercial Solution, Communications, Consumer, Design & Construction, Electronics, Energy, Energy, Health Care, Manufacturing, Mining, Oil & Gas, Safety and Transportation and other markets.  3M owns substantially all of its physical properties and serves customers worldwide. The Company businesses share technologies, manufacturing operations, marketing channels, and other resources. 3M is headquartered in St. Paul, Minnesota.",
      "3M CENTER  BLDG. 220-11W-02",
      null,
      "ST PAUL",
      "MN",
      "US",
      "55144",
      "651-733-1110",
      "651-733-9973",
      null,
      "http://www.3m.com",
      0.97,
      12,
      3841,
      "Surgical & medical instruments",
      48,
      "DIVERSIFIED OPS",
      9,
      "Multi-Sector Conglomerates",
      30,
      "CONGLOMERATES",
      94987,
      112667.68,
      32184,
      5384,
      20.41,
      20.77,
      2.15,
      3.42,
      8.15,
      16.03,
      44,
      11.8,
      21.51,
      17.34,
      16.56,
      4.04,
      1.83,
      1.35,
      1.22,
      5.92,
      3.04,
      579.42,
      2097695.5,
      23.86,
      9.8,
      "2021-03-31",
      2.25,
      2.77,
      0.52,
      23.11,
      "2021-12-31",
      9.58,
      "2022-12-31",
      10.51,
      8.74,
      2,
      0,
      5,
      1,
      1,
      2.89,
      2.89,
      0.34,
      65.55,
      577.447
    ],
    [
      "MRK",
      "MRK",
      "MERCK & CO INC",
      "Merck & Co., Inc.",
      "NYSE",
      "USD",
      "Merck & Co., Inc., a leading global biopharmaceutical company known as MSD outside of the United States and Canada, has been inventing for life, bringing forward medicines and vaccines for many of the world's most challenging diseases. Through their prescription medicines, vaccines, biologic therapies and animal health products, they work with customers and operate the countries to deliver innovative health solutions. The Company also demonstrate their commitment to increasing access to health care through far-reaching policies, programs and partnerships. Merck continues to be at the forefront of research to advance the prevention and treatment of diseases that threaten people and communities around the world - including cancer, cardio-metabolic diseases, emerging animal diseases, Alzheimer's disease and infectious diseases including HIV and Ebola.",
      "2000 GALLOPING HILL ROAD",
      null,
      "KENILWORTH",
      "NJ",
      "US",
      "07033",
      "908-740-4000",
      "908-735-1253",
      "investor_relations@merck.com",
      "http://www.merck.com",
      0.42,
      12,
      2834,
      "Pharmaceutical preparations",
      225,
      "Large Cap Pharma",
      4,
      "Medical",
      15,
      "DRUGS",
      74000,
      195750.8,
      47994,
      7067,
      11.79,
      13.05,
      1.92,
      4.08,
      7.7,
      10.46,
      55.49,
      16.9,
      18.32,
      14.73,
      31.43,
      2.54,
      1.02,
      0.79,
      1,
      2.6,
      3.36,
      2530.39,
      9512901,
      10.04,
      2.76999,
      "2020-12-31",
      1.36,
      1.32,
      -0.04,
      -2.94,
      "2021-12-31",
      6.56,
      "2022-12-31",
      6.96,
      5.94,
      8,
      0,
      4,
      0,
      0,
      1.67,
      1.67,
      0.32,
      73.72,
      2522.291
    ],
    [
      "MSFT",
      "MSFT",
      "MICROSOFT CORP",
      "Microsoft Corporation",
      "NSDQ",
      "USD",
      "Microsoft is a technology company. Their products include operating systems for computing devices, servers, phones, and other intelligent devices; server applications for distributed computing environments; cross-device productivity applications; business solution applications; desktop and server management tools; software development tools; video games; and online advertising. They also design and sell hardware including PCs, tablets, gaming and entertainment consoles, phones, other intelligent devices, and related accessories. They offer cloud-based solutions that provide customers with software, services, platforms, and content. They also provide consulting and product and solution support services, and they train and certify computer system integrators and developers.",
      "ONE MICROSOFT WAY",
      null,
      "REDMOND",
      "WA",
      "US",
      "98052",
      "425-882-8080",
      "425-706-7329",
      "msft@microsoft.com",
      "http://www.microsoft.com",
      0.8,
      6,
      7372,
      "Prepackaged software",
      44,
      "COMP-SOFTWARE",
      10,
      "Computer and Technology",
      32,
      "COMPUTER SOFT/SERV",
      163000,
      1975834.25,
      143015,
      44281,
      35.54,
      36.08,
      2.76,
      12.35,
      15.17,
      34.73,
      44.68,
      18.33,
      39.62,
      35.02,
      34.63,
      23.76,
      2.58,
      2.55,
      0.42,
      2.24,
      0.86,
      7542.22,
      24694228,
      15.63,
      7.34,
      "2021-03-31",
      1.76,
      1.95,
      0.19,
      10.8,
      "2021-06-30",
      7.49,
      "2022-06-30",
      8.18,
      5.76,
      21,
      1,
      0,
      0,
      0,
      1.05,
      1.07,
      0.05,
      70.4,
      7538.445
    ],
    [
      "NIKE",
      "NKE",
      "NIKE INC-B",
      "NIKE, Inc.",
      "NYSE",
      "USD",
      "Nike, Inc., based near Beaverton, Oregon, is the world's leading designer, marketer and distributor of authentic athletic footwear, apparel, equipment and accessories for a wide variety of sports and fitness activities. Wholly-owned NIKE, Inc. subsidiary brands include Converse, which designs, markets and distributes athletic lifestyle footwear, apparel and accessories; and Hurley, which designs, markets and distributes surf and youth lifestyle footwear, apparel and accessories.",
      "ONE BOWERMAN DRIVE",
      null,
      "BEAVERTON",
      "OR",
      "US",
      "97005",
      "503-671-6453",
      "503-671-6300",
      "investor.relations@nike.com",
      "http://www.nike.com",
      0.87,
      5,
      3021,
      "Rubber & plastics footwear",
      173,
      "SHOES&REL APPRL",
      2,
      "Consumer Discretionary",
      1,
      "APPAREL",
      75400,
      208729.45,
      37403,
      2539,
      42.33,
      62.32,
      2.46,
      5.42,
      17.5,
      50.75,
      34.41,
      10.11,
      10.4,
      8.9,
      8.9,
      3.25,
      2.78,
      2.02,
      0.79,
      1.1,
      0.83,
      1579.97,
      6655708,
      7.55,
      2.11999,
      "2021-02-28",
      0.75,
      0.9,
      0.15,
      20,
      "2021-05-31",
      3.12,
      "2022-05-31",
      3.85,
      1.85,
      16,
      3,
      2,
      0,
      0,
      1.31,
      1.33,
      3.8,
      65.76,
      1519.928
    ],
    [
      "PFE",
      "PFE",
      "PFIZER INC",
      "Pfizer Inc.",
      "NYSE",
      "USD",
      "Pfizer Inc. is a research-based, global pharmaceutical company that discovers, develops, manufactures, and markets medicines for humans and animals. The Company's diversified global healthcare portfolio includes human and animal biologic and small molecule medicines and vaccines, as well as nutritional products and consumer healthcare products. Pfizer's Animal Health business unit discovers, develops and sells products for the prevention and treatment of diseases in livestock and companion animals. It sells its products to wholesalers, distributors, retailers, hospitals, clinics, government agencies, pharmacies, individual provider offices, veterinarians, livestock producers, and grocery and convenience stores. Pfizer Inc. is headquartered in New York.",
      "235 EAST 42ND STREET",
      null,
      "NEW YORK",
      "NY",
      "US",
      "10017",
      "212-733-2323",
      "302-655-5049",
      null,
      "http://www.pfizer.com",
      0.72,
      12,
      2834,
      "Pharmaceutical preparations",
      225,
      "Large Cap Pharma",
      4,
      "Medical",
      15,
      "DRUGS",
      78500,
      214459.88,
      41908,
      9616,
      11.64,
      14.14,
      1.53,
      4.5,
      3.37,
      12.37,
      23.73,
      9.07,
      17.89,
      20.18,
      32.23,
      1.01,
      1.35,
      1.04,
      0.59,
      1.56,
      4.06,
      5577.63,
      25566528,
      11.42,
      1.71,
      "2020-12-31",
      0.46,
      0.42,
      -0.04,
      -8.7,
      "2021-12-31",
      3.3,
      "2022-12-31",
      3.03,
      2.22,
      5,
      0,
      9,
      0,
      0,
      2.29,
      2.29,
      0.05,
      66.1,
      5574.841
    ],
    [
      "PG",
      "PG",
      "PROCTER & GAMBL",
      "Procter & Gamble Company (The)",
      "NYSE",
      "USD",
      "The Procter & Gamble Company is engaged in the manufacture and sale of a range of branded consumer packaged goods. The company operates in five segments: Beauty, Grooming, Health Care, Fabric Care and Home Care, and Baby Care and Family Care. The Beauty segment provides antiperspirants, deodorants, cosmetics, hair care products, personal cleansings, prestige products, and skin care products. The Grooming segment offers blades and razors, electronic hair removal devices, hair care appliances. The Health Care segment provides feminine care, gastrointestinal, incontinence, rapid diagnostics, respiratory, oral care, and other personal health care products. The Fabric Care and Home Care segment offers bleach and laundry additives, air care products, batteries, dish care items, fabric enhancers, laundry detergents, pet care products, and surface care products. The Baby Care and Family Care segment provides baby wipes, diapers and pants, tissues, and toilet papers. The Procter & Gamble is based in Cincinnati, Ohio.",
      "One Procter & Gamble Plaza",
      null,
      "Cincinnati",
      "OH",
      "US",
      "45202",
      "513-983-1100",
      "513-983-9369",
      "pginvestors@linkintime.co.in",
      "https://us.pg.com",
      0.44,
      6,
      2840,
      "Soap, detergents, & cleaning preparations; perfumes, & cosmetics",
      174,
      "SOAP&CLNG PREPS",
      1,
      "Consumer Staples",
      5,
      "SOAPS/COSMETICS",
      99000,
      321159.16,
      70950,
      13027,
      23.33,
      23.05,
      3.33,
      4.29,
      6.97,
      19.74,
      31.71,
      12.44,
      23.39,
      18.97,
      19.84,
      6.26,
      0.71,
      0.52,
      0.46,
      3.48,
      2.65,
      2448.23,
      7691095,
      18.81,
      5.43,
      "2021-03-31",
      1.18,
      1.26,
      0.08,
      6.78,
      "2021-06-30",
      5.62,
      "2022-06-30",
      5.92,
      5.12,
      6,
      1,
      4,
      0,
      0,
      1.77,
      1.77,
      0.7,
      64.18,
      2431.095
    ],
    [
      "SPM",
      "TRV",
      "TRAVELERS COS",
      "The Travelers Companies, Inc.",
      "NYSE",
      "USD",
      "The Travelers Companies, Inc. is an insurance company that cares. Travelers takes on the risk and provides the coverage you need to protect the things that are important to Client - Client's home, Client's car, Client's valuables and Client's business - so Client don't have to worry. They have been around for more than 160 years and have earned a reputation as one of the best property casualty insurers in the industry because they take care of their customers. Their expertise and focus on innovation have made us a leader in personal, business and specialty insurance and the only property casualty company in the Dow Jones Industrial Average. Every day, their approximately 30,000 employees and 13,500 independent agents and brokers in the United States, Canada, the United Kingdom, Ireland and Brazil help provide peace of mind to their customers.",
      "485 Lexington Avenue",
      null,
      "New York",
      "NY",
      "US",
      "10017",
      "917-778-6000",
      "651-310-8204",
      "gnawi@travelers.com",
      "http://www.travelers.com",
      0.75,
      12,
      6331,
      "Fire, marine, & casualty insurance",
      89,
      "INS-PROP&CASLTY",
      13,
      "Finance",
      49,
      "INSURANCE",
      30600,
      39027.41,
      31981,
      2697,
      13.82,
      14.7,
      2.22,
      1.21,
      1.38,
      4.77,
      9.65,
      2.34,
      10.52,
      8.74,
      8.36,
      null,
      0.37,
      0.37,
      0.23,
      3.4,
      2.19,
      251.46,
      1351038.5,
      112.42,
      11.03999,
      "2021-03-31",
      2.44,
      2.73,
      0.29,
      11.89,
      "2021-12-31",
      11.23,
      "2022-12-31",
      12.46,
      10.48,
      5,
      0,
      7,
      0,
      3,
      2.69,
      2.69,
      0.92,
      83.66,
      249.152
    ],
    [
      "UNIH",
      "UNH",
      "UNITEDHEALTH GP",
      "UnitedHealth Group Incorporated",
      "NYSE",
      "USD",
      "UnitedHealthcare Group Inc. is dedicated to helping people nationwide live healthier lives by simplifying the health care experience, meeting consumer health and wellness needs and sustaining trusted relationships with care providers. The company offers the full spectrum of health benefit programs for individuals, employers, military service members, retirees and their families, and Medicare and Medicaid beneficiaries, and contracts directly with the physicians and care professionals, and hospitals and other care facilities nationwide.",
      "9900 BREN ROAD EAST",
      null,
      "MINNETONKA",
      "MN",
      "US",
      "55343",
      "952-936-1300",
      "952-936-1819",
      "investor_relations@uhc.com",
      "http://www.unitedhealthgroup.com",
      0.77,
      12,
      6324,
      "Hospital & medical service plans",
      108,
      "MED-HMO",
      4,
      "Medical",
      16,
      "MEDICAL CARE",
      330000,
      372364.03,
      257141,
      15403,
      21.27,
      21.37,
      1.66,
      1.42,
      5.37,
      19.51,
      26.04,
      9.02,
      8.57,
      6.42,
      6.74,
      null,
      0.74,
      0.74,
      0.54,
      5,
      1.27,
      943.89,
      2675897.5,
      73.43,
      17.59,
      "2021-03-31",
      4.42,
      5.31,
      0.89,
      20.14,
      "2021-12-31",
      18.54,
      "2022-12-31",
      19.5,
      16.88,
      12,
      1,
      3,
      0,
      0,
      1.41,
      1.38,
      0.8,
      87.45,
      937.756
    ],
    [
      "VISA",
      "V",
      "VISA INC-A",
      "Visa Inc.",
      "NYSE",
      "USD",
      "Visa Inc. is a global payment technology company that connects consumers, businesses, banks, and governments enabling them to use digital currency instead of cash and checks. Visa Inc. mission is to connect the world through the most innovative, reliable and secure payment network - enabling individuals, businesses and economies to thrive. Visa Inc. advanced global processing network, VisaNet, provides secure and reliable payments around the world, and is capable of handling more than 65,000 transaction messages a second. The company's relentless focus on innovation is a catalyst for the rapid growth of connected commerce on any device, and a driving force behind the dream of a cashless future for everyone, everywhere. As the world moves from analog to digital, Visa is applying brand, products, people, network and scale to reshape the future of commerce.",
      "P.O. BOX 8999",
      null,
      "SAN FRANCISCO",
      "CA",
      "US",
      "94128",
      "650-432-3200",
      null,
      "ir@visa.com",
      "http://usa.visa.com",
      0.98,
      9,
      7389,
      "Business services, not elsewhere classified",
      282,
      "Financial Transaction Services",
      16,
      "Business Services",
      59,
      "BUSINESS SERVICES",
      20500,
      448856.22,
      21846,
      10866,
      41.65,
      46.17,
      2.2,
      21.02,
      13.2,
      37.39,
      34.54,
      13.77,
      63.15,
      49.93,
      51.41,
      null,
      2.12,
      2.12,
      0.62,
      1.28,
      0.56,
      1952.31,
      6915968,
      16.05,
      4.84,
      "2021-03-31",
      1.26,
      1.38,
      0.12,
      9.52,
      "2021-09-30",
      5.57,
      "2022-09-30",
      6.94,
      5.04,
      18,
      2,
      3,
      0,
      0,
      1.35,
      1.42,
      0.19,
      81.01,
      1948.604
    ],
    [
      "BEL",
      "VZ",
      "VERIZON COMM",
      "Verizon Communications Inc.",
      "NYSE",
      "USD",
      "Verizon Communications Inc. is one of the largest communication technology companies. Its Wireless segment offers wireless voice and data services; Internet access on various smart and basic phones, notebook computers, and tablets; and multimedia access, business-focused, location-based, global data, home phone handsets, and high-speed Internet services, as well as network access and value added services to support wireless connections for the Internet of Things (IoT). The Company's Wireline segment offers high-speed Internet, Fios Internet, and Fios video services; voice services, such as local exchange, regional and long distance calling, and voice messaging services, as well as Voice over Internet protocol services; network products and solutions comprising private Internet protocol (IP), public Internet, Ethernet, and optical networking services; IT infrastructure services that include collocation and managed hosting services; cloud services, which comprise computing, storage, backup, and recovery.",
      "1095 AVENUE OF THE AMERICAS",
      null,
      "NEW YORK",
      "NY",
      "US",
      "10036",
      "212-395-1000",
      "212-571-1897",
      "michael.stefanski@verizon.com",
      "http://www.verizon.com",
      0.48,
      12,
      4813,
      "Telephone communication, except radio",
      238,
      "Wireless National",
      10,
      "Computer and Technology",
      37,
      "TELECOMM SVCS",
      132200,
      233164.8,
      128292,
      17801,
      11.11,
      11.38,
      3.85,
      1.8,
      3.21,
      6.3,
      30.1,
      6.55,
      19.58,
      14.58,
      15.84,
      35.88,
      1.02,
      0.99,
      2.06,
      2.51,
      4.46,
      4140,
      15377467,
      17.56,
      4.55999,
      "2021-03-31",
      1.29,
      1.31,
      0.02,
      1.55,
      "2021-12-31",
      5.07,
      "2022-12-31",
      5.19,
      4.9,
      7,
      2,
      8,
      0,
      0,
      2.06,
      1.94,
      0.1,
      66.43,
      4135.86
    ],
    [
      "WMS",
      "WMT",
      "WALMART INC",
      "Walmart Inc.",
      "NYSE",
      "USD",
      "Walmart Inc. is a multinational retail corporation which operates a chain of hypermarkets, discount department stores and grocery stores. Walmart Inc., formerly known as Wal-Mart Stores, Inc., is headquartered in Bentonville, Arkansas.",
      "702 SOUTHWEST 8TH ST",
      null,
      "BENTONVILLE",
      "AR",
      "US",
      "72716",
      "479-273-4000",
      "479-277-1830",
      "invrelinq@wal-mart.com",
      "http://www.stock.walmart.com",
      0.47,
      1,
      5331,
      "Variety stores",
      167,
      "RETAIL-SUPERMKT",
      3,
      "Retail/Wholesale",
      13,
      "FOOD/DRUG-RTL/WHL",
      2300000,
      389465.06,
      559151,
      13510,
      25.52,
      25.3,
      4.64,
      0.7,
      4.47,
      14.64,
      18.85,
      6.4,
      3.68,
      2.42,
      2.78,
      9.39,
      0.97,
      0.49,
      0.51,
      2.2,
      1.59,
      2814.46,
      7172695,
      30.94,
      4.73,
      "2021-01-31",
      1.51,
      1.39,
      -0.12,
      -7.95,
      "2022-01-31",
      5.42,
      "2023-01-31",
      5.89,
      5.48,
      13,
      3,
      4,
      0,
      0,
      1.52,
      1.52,
      50.43,
      30.24,
      1395.128
    ],
    [
      "J",
      "XOM",
      "EXXON MOBIL CRP",
      "Exxon Mobil Corporation",
      "NYSE",
      "USD",
      "Exxon Mobil Corporation is the largest publicly traded international energy company, uses technology and innovation to help meet the world's growing energy needs. Its principal business is energy, involving exploration for, and production of, crude oil and natural gas, manufacturing of petroleum products and transportation and sale of crude oil and natural gas, natural gas and petroleum products.  Exxon Mobil is a major manufacturer and marketer of basic petrochemicals, including olefins, aromatics, polyethylene and polypropylene plastics and a wide variety of specialty products. Exxon Mobil is engaged in exploration for, and mining and sale of coal, copper and other minerals. ExxonMobil holds an industry leading inventory of resources, is one of the largest refiners and marketers of petroleum products and its chemical company is one of the largest in the world.",
      "5959 LAS COLINAS BOULEVARD",
      null,
      "IRVING",
      "TX",
      "US",
      "75039",
      "972-940-6000",
      "972-444-1433",
      null,
      "http://corporate.exxonmobil.com",
      1.44,
      12,
      2911,
      "Petroleum refining",
      132,
      "OIL-INTL INTGD",
      12,
      "Oils/Energy",
      44,
      "OIL-INTEGRATED",
      72000,
      238813,
      181502,
      -22440,
      17.29,
      null,
      1.82,
      1.32,
      1.45,
      5.35,
      -0.72,
      -0.37,
      -15.91,
      -12.36,
      -0.71,
      8.26,
      0.8,
      0.46,
      0.29,
      3.48,
      6.17,
      4233.52,
      19948738,
      38.82,
      -5.25,
      "2020-12-31",
      0.01,
      0.03,
      0.02,
      200,
      "2021-12-31",
      3.26,
      "2022-12-31",
      3.86,
      -0.33,
      6,
      0,
      10,
      0,
      0,
      2.25,
      2.25,
      0.05,
      51.44,
      4231.405
    ]
  ],
  "columns": [
    {
      "name": "m_ticker",
      "type": "String"
    },
    {
      "name": "ticker",
      "type": "String"
    },
    {
      "name": "comp_name",
      "type": "String"
    },
    {
      "name": "comp_name_2",
      "type": "String"
    },
    {
      "name": "exchange",
      "type": "String"
    },
    {
      "name": "currency_code",
      "type": "String"
    },
    {
      "name": "comp_desc",
      "type": "text"
    },
    {
      "name": "address_line_1",
      "type": "String"
    },
    {
      "name": "address_line_2",
      "type": "String"
    },
    {
      "name": "city",
      "type": "String"
    },
    {
      "name": "state_code",
      "type": "String"
    },
    {
      "name": "country_code",
      "type": "String"
    },
    {
      "name": "post_code",
      "type": "String"
    },
    {
      "name": "phone_nbr",
      "type": "String"
    },
    {
      "name": "fax_nbr",
      "type": "String"
    },
    {
      "name": "email",
      "type": "String"
    },
    {
      "name": "comp_url",
      "type": "String"
    },
    {
      "name": "beta",
      "type": "BigDecimal(10,2)"
    },
    {
      "name": "per_end_month_nbr",
      "type": "Integer"
    },
    {
      "name": "sic_4_code",
      "type": "Integer"
    },
    {
      "name": "sic_4_desc",
      "type": "String"
    },
    {
      "name": "zacks_x_ind_code",
      "type": "Integer"
    },
    {
      "name": "zacks_x_ind_desc",
      "type": "String"
    },
    {
      "name": "zacks_x_sector_code",
      "type": "Integer"
    },
    {
      "name": "zacks_x_sector_desc",
      "type": "String"
    },
    {
      "name": "zacks_m_ind_code",
      "type": "Integer"
    },
    {
      "name": "zacks_m_ind_desc",
      "type": "String"
    },
    {
      "name": "emp_cnt",
      "type": "Integer"
    },
    {
      "name": "market_val",
      "type": "BigDecimal(14,2)"
    },
    {
      "name": "tot_revenue_f0",
      "type": "BigDecimal(9,2)"
    },
    {
      "name": "net_income_f0",
      "type": "BigDecimal(15,2)"
    },
    {
      "name": "pe_ratio_f1",
      "type": "double"
    },
    {
      "name": "pe_ratio_12m",
      "type": "BigDecimal(7,2)"
    },
    {
      "name": "peg_ratio",
      "type": "BigDecimal(10,3)"
    },
    {
      "name": "price_per_sales",
      "type": "double"
    },
    {
      "name": "price_book",
      "type": "BigDecimal(10,2)"
    },
    {
      "name": "price_cash",
      "type": "BigDecimal(10,2)"
    },
    {
      "name": "roe_q0",
      "type": "BigDecimal(34,12)"
    },
    {
      "name": "roa_q0",
      "type": "BigDecimal(12,2)"
    },
    {
      "name": "pre_tax_margin_q0",
      "type": "double"
    },
    {
      "name": "net_margin_q0",
      "type": "BigDecimal(8,2)"
    },
    {
      "name": "zacks_oper_margin_q0",
      "type": "BigDecimal(8,2)"
    },
    {
      "name": "inv_turnover_q0",
      "type": "double"
    },
    {
      "name": "curr_ratio_q0",
      "type": "BigDecimal(8,2)"
    },
    {
      "name": "quick_ratio_q0",
      "type": "BigDecimal(8,2)"
    },
    {
      "name": "debt_to_comm_equ_q0",
      "type": "BigDecimal(9,2)"
    },
    {
      "name": "iad",
      "type": "BigDecimal(8,2)"
    },
    {
      "name": "div_yield",
      "type": "BigDecimal(8,2)"
    },
    {
      "name": "shares_out",
      "type": "BigDecimal(10,2)"
    },
    {
      "name": "avg_vol_20d",
      "type": "BigDecimal(11,2)"
    },
    {
      "name": "bvps_f0",
      "type": "BigDecimal(10,2)"
    },
    {
      "name": "diluted_eps_net_4q",
      "type": "BigDecimal(30,6)"
    },
    {
      "name": "per_end_date_qr0",
      "type": "Date"
    },
    {
      "name": "eps_mean_est_qr0",
      "type": "BigDecimal(7,2)"
    },
    {
      "name": "eps_act_qr0",
      "type": "BigDecimal(7,2)"
    },
    {
      "name": "eps_amt_diff_surp_qr0",
      "type": "BigDecimal(10,2)"
    },
    {
      "name": "eps_pct_diff_surp_qr0",
      "type": "BigDecimal(8,2)"
    },
    {
      "name": "per_end_date_fr1",
      "type": "Date"
    },
    {
      "name": "eps_mean_est_fr1",
      "type": "BigDecimal(7,2)"
    },
    {
      "name": "per_end_date_fr2",
      "type": "Date"
    },
    {
      "name": "eps_mean_est_fr2",
      "type": "BigDecimal(7,2)"
    },
    {
      "name": "eps_act_fr0",
      "type": "BigDecimal(7,2)"
    },
    {
      "name": "rating_cnt_strong_buys",
      "type": "Integer"
    },
    {
      "name": "rating_cnt_buys",
      "type": "Integer"
    },
    {
      "name": "rating_cnt_holds",
      "type": "Integer"
    },
    {
      "name": "rating_cnt_sells",
      "type": "Integer"
    },
    {
      "name": "rating_cnt_strong_sells",
      "type": "Integer"
    },
    {
      "name": "cons_recom_curr",
      "type": "BigDecimal(3,2)"
    },
    {
      "name": "cons_recom_7d_ago",
      "type": "BigDecimal(3,2)"
    },
    {
      "name": "held_by_insiders_pct",
      "type": "BigDecimal(34,12)"
    },
    {
      "name": "held_by_institutions_pct",
      "type": "BigDecimal(34,12)"
    },
    {
      "name": "free_float",
      "type": "BigDecimal(34,12)"
    }
  ]
}